vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/i3c_bus/fsl_component_i3c.h
/*
 * Copyright 2020, 2022, 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _I3C_COMPONENT_H_
#define _I3C_COMPONENT_H_

#include "fsl_component_generic_list.h"

/*!
 * @addtogroup I3C_Bus_Component
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name I3C BUS management definitions*/
/*! @{ */
#define I3C_BUS_MAX_DEVS                          11U   /*!< Bus maximum device count. */
#define I3C_BUS_HOT_JOIN_ADDR                     0x2U  /*!< Hot join event device address. */
#define I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR1 0x3EU /*!< Broadcast address single bit error detect address. */
#define I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR2 0x5EU /*!< Broadcast address single bit error detect address. */
#define I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR3 0x6EU /*!< Broadcast address single bit error detect address. */
#define I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR4 0x76U /*!< Broadcast address single bit error detect address. */
#define I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR5 0x7AU /*!< Broadcast address single bit error detect address. */
#define I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR6 0x7CU /*!< Broadcast address single bit error detect address. */
#define I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR7 0x7FU /*!< Broadcast address single bit error detect address. */
#define I3C_BUS_BROADCAST_ADDR                    0x7EU /*!< Broad cast address. */
#define I3C_BUS_MAX_ADDR                          0x7FU /*!< Maximum address allowed for address assignment. */
#define I3C_BUS_ADDR_SLOTWIDTH                    2U  /*!< Address slot width used in address management in bus pool. */
#define I3C_BUS_ADDR_SLOTDEPTH                    32U /*!< Address slot depth used in address management in bus pool. */
#define I3C_BUS_ADDR_SLOTMASK                     3U  /*!< Address slot mask used in address management in bus pool. */

/*! @} */

/*! @name I3C BUS CCC (Common Command Codes) definitions*/
/*! @{ */
#define I3C_BUS_CCC_DIRECT_PREFIX 0x80U /*!< Prefix used for direct access CCC. */

#define I3C_BUS_CCC(cmdID, isDirect) \
    ((cmdID) | ((isDirect) ? I3C_BUS_CCC_DIRECT_PREFIX : 0U)) /*!< CCC ID calculation. */

/* CCC available for both broadcast and direct access */
#define I3C_BUS_CCC_ENEC(isDirect)      I3C_BUS_CCC(0x0U, isDirect)        /*!< Enable Slave Events Command. */
#define I3C_BUS_CCC_DISEC(isDirect)     I3C_BUS_CCC(0x1U, isDirect)        /*!< Disable Slave Events Command. */
#define I3C_BUS_CCC_ENTAS(as, isDirect) I3C_BUS_CCC(0x2U + (as), isDirect) /*!< Enter Activity State 0–3 Command. */
#define I3C_BUS_CCC_RSTDAA(isDirect)    I3C_BUS_CCC(0x6U, isDirect) /*!< Reset Dynamic Address Assignment Command. */
#define I3C_BUS_CCC_SETMWL(isDirect)    I3C_BUS_CCC(0x9U, isDirect) /*!< Set Max Write Length Command. */
#define I3C_BUS_CCC_SETMRL(isDirect)    I3C_BUS_CCC(0xaU, isDirect) /*!< Set Max Read Length Command. */
#define I3C_BUS_CCC_SETXTIME(isDirect)  (isDirect) ? 0x98U : 0x28U  /*!< Set Exchange Timing Information Command. */
#define I3C_BUS_CCC_VENDOR_EXT(cmdID, isDirect) \
    ((cmdID) + ((isDirect) ? 0xe0U : 0x61U))                        /*!< Vendor Extension Command. */

/* CCC available only for broadcast access */
#define I3C_BUS_CCC_ENTDAA    0x7U        /*!< Enter Dynamic Address Assignment Command. */
#define I3C_BUS_CCC_DEFSLVS   0x8U        /*!< Send Define List of Slaves Command. */
#define I3C_BUS_CCC_ENTTM     0xbU        /*!< Enter Test Mode Command. */
#define I3C_BUS_CCC_ENTHDR(x) 0x20U + (x) /*!< Enter HDR Command. */

/* CCC available only for direct access */
#define I3C_BUS_CCC_SETDASA   0x87U /*!< Set Dynamic Address from Static Address Command. */
#define I3C_BUS_CCC_SETNEWDA  0x88U /*!< Set New Dynamic Address Command. */
#define I3C_BUS_CCC_GETMWL    0x8bU /*!< Get Max Write Length Command. */
#define I3C_BUS_CCC_GETMRL    0x8cU /*!< Get Max Read Length Command. */
#define I3C_BUS_CCC_GETPID    0x8dU /*!< Get Provisional ID Command. */
#define I3C_BUS_CCC_GETBCR    0x8eU /*!< Get BCR Command. */
#define I3C_BUS_CCC_GETDCR    0x8fU /*!< Get DCR Command. */
#define I3C_BUS_CCC_GETSTATUS 0x90U /*!< Get Device Status Command. */
#define I3C_BUS_CCC_GETACCMST 0x91U /*!< Get Accept Mastership Command. */
#define I3C_BUS_CCC_SETBRGTGT 0x93U /*!< Set Bridge Targets Command. */
#define I3C_BUS_CCC_GETMXDS   0x94U /*!< Get Max Data Speed Command. */
#define I3C_BUS_CCC_GETHDRCAP 0x95U /*!< Get HDR Capability Command. */
#define I3C_BUS_CCC_GETXTIME  0x99U /*!< Get Exchange Timing Support Command. */

/*! @} */

/*! @name I3C device BCR register bit masks*/
/*! @{ */

/* @brief I3C device bus characteristics */
#define I3C_BUS_DEV_BCR_DEV_MASTER     0x01U

/*!< 0 - I3C Target, 1 - I3C Controller capable, Other - Reserved. */
#define I3C_BUS_DEV_BCR_DEV_ROLE_SHIFT 6U
#define I3C_BUS_DEV_BCR_DEV_ROLE_MASK  0xC0U
#define I3C_BUS_DEV_BCR_DEV_ROLE(x)    (((x) << I3C_BUS_DEV_BCR_DEV_ROLE_SHIFT) & I3C_BUS_DEV_BCR_DEV_ROLE_MASK)

/*!< Supports optional advanced capabilities */
#define I3C_BUS_DEV_BCR_MODE_SHIFT 5U
#define I3C_BUS_DEV_BCR_MODE_MASK  0x20U
#define I3C_BUS_DEV_BCR_MODE(x)    (((x) << I3C_BUS_DEV_BCR_MODE_SHIFT) & I3C_BUS_DEV_BCR_MODE_MASK)

/*!< Virtual Target, exposes other downstream Device(s) or not. */
#define I3C_BUS_DEV_BCR_VIRTUAL_TARGET_SHIFT 4U
#define I3C_BUS_DEV_BCR_VIRTUAL_TARGET_MASK  0x10U
#define I3C_BUS_DEV_BCR_VIRTUAL_TARGET(x)    (((x) << I3C_BUS_DEV_BCR_VIRTUAL_TARGET_SHIFT) & I3C_BUS_DEV_BCR_VIRTUAL_TARGET_MASK)

/*!< 0 - No data bytes follow IBI, 1 - There's one or more bytes. */
#define I3C_BUS_DEV_BCR_OFFLINE_CAP_SHIFT 3U
#define I3C_BUS_DEV_BCR_OFFLINE_CAP_TARGET_MASK  0x08U
#define I3C_BUS_DEV_BCR_OFFLINE_CAP_TARGET(x)    (((x) << I3C_BUS_DEV_BCR_OFFLINE_CAP_SHIFT) & I3C_BUS_DEV_BCR_OFFLINE_CAP_TARGET_MASK)

/*!< 0 - No data bytes follow IBI, 1 - There's one or more bytes. */
#define I3C_BUS_DEV_BCR_IBI_PAYLOAD_SHIFT 2U
#define I3C_BUS_DEV_BCR_IBI_PAYLOAD_MASK  0x04U
#define I3C_BUS_DEV_BCR_IBI_PAYLOAD(x)    (((x) << I3C_BUS_DEV_BCR_IBI_PAYLOAD_SHIFT) & I3C_BUS_DEV_BCR_IBI_PAYLOAD_MASK)

