vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/i3c_bus/fsl_component_i3c.h
/*!< 0 - No capable, 1 - Capable. */
#define I3C_BUS_DEV_BCR_IBI_REQUEST_SHIFT 1U
#define I3C_BUS_DEV_BCR_IBI_REQUEST_MASK  0x02U
#define I3C_BUS_DEV_BCR_IBI_REQUEST(x)    (((x) << I3C_BUS_DEV_BCR_IBI_REQUEST_SHIFT) & I3C_BUS_DEV_BCR_IBI_REQUEST_MASK)

/*!< 0 - No limitation, 1 - Limitation. */
#define I3C_BUS_DEV_BCR_SPEED_LIMIT_SHIFT 0U
#define I3C_BUS_DEV_BCR_SPEED_LIMIT_MASK  0x01U
#define I3C_BUS_DEV_BCR_SPEED_LIMIT(x)    (((x) << I3C_BUS_DEV_BCR_SPEED_LIMIT_SHIFT) & I3C_BUS_DEV_BCR_SPEED_LIMIT_MASK)

/*! @} */

/*! @brief I3C Bus status. */
enum
{
    kStatus_I3CBus_Success         = kStatus_Success,                      /*!< I3C Bus operation succeed*/
    kStatus_I3CBus_AddrSlotInvalid = MAKE_STATUS(kStatusGroup_I3CBUS, 0U), /*!< I3C Bus address slot invalid */
    kStatus_I3CBus_MasterOpsUnsupport =
        MAKE_STATUS(kStatusGroup_I3CBUS, 1U),                              /*!< I3C Bus master operation unsupported */
    kStatus_I3CBus_NotCurrentMaster = MAKE_STATUS(
        kStatusGroup_I3CBUS, 2U), /*!< The Bus operation should be made on master but current device is not master */
    kStatus_I3CBus_MasterOpsFailure   = MAKE_STATUS(kStatusGroup_I3CBUS, 3U), /*!< Bus operation failure */
    kStatus_I3CBus_InvalidOps         = MAKE_STATUS(kStatusGroup_I3CBUS, 4U), /*!< Master transfer timeout on bus */
    kStatus_I3CBus_MasterTransTimeout = MAKE_STATUS(kStatusGroup_I3CBUS, 5U), /*!< Master transfer timeout on bus */
    kStatus_I3CBus_SlaveOpsNotSupported =
        MAKE_STATUS(kStatusGroup_I3CBUS, 6U), /*!< I3C Bus slave operation unsupported */
    kStatus_I3CBus_MasterOpsMissing =
        MAKE_STATUS(kStatusGroup_I3CBUS, 7U), /*!< I3C Bus master mandatory operation missing */
};

/*! @brief I3C bus events. */
enum _i3c_bus_events
{
    kI3C_EventIBI = 1U, /*!< I3C Bus event IBI */
    kI3C_EventMR  = 2U, /*!< I3C Bus event Mastership Request */
    kI3C_EventHJ  = 8U, /*!< I3C Bus event Hot Join */
};

/*! @brief I3C device information. */
typedef struct _i3c_device_information
{
    uint8_t dynamicAddr;     /*!< Device dynamic address. */
    uint8_t staticAddr;      /*!< Static address. */
    uint8_t dcr;             /*!< Device characteristics register information. */
    uint8_t bcr;             /*!< Bus characteristics register information. */
    uint16_t vendorID;       /*!< Device vendor ID(manufacture ID). */
    uint32_t partNumber;     /*!< Device part number info */
    uint16_t maxReadLength;  /*!< Maximum read length. */
    uint16_t maxWriteLength; /*!< Maximum write length. */
    uint8_t maxIBILength;    /*!< Maximum ibi payload length. */
    uint8_t hdrMode;         /*!< Support hdr mode, could be OR logic in i3c_hdr_mode. */
} i3c_device_information_t;

/* Forward declaration of the i3c_bus_t typedef. */
typedef struct _i3c_bus i3c_bus_t;

/* Forward declaration of the i3c_device_control_info_t typedef. */
typedef struct _i3c_device_control_info i3c_device_control_info_t;

/* Forward declaration of the i3c_device_ibi_info_t typedef. */
typedef struct _i3c_device_ibi_info i3c_device_ibi_info_t;

/*! @brief I3C device definition. */
typedef struct _i3c_device
{
    list_element_t listNode;                   /*!< list node to link i3c devices in i3c bus. */
    i3c_bus_t *bus;                            /*!< I3C bus pointer, points to current bus the device is attached. */
    i3c_device_control_info_t *devControlInfo; /*!< Pointer to control information structure of the device. */
    i3c_device_information_t info;             /*!< Pointer to device information structure of the device. */
    uint8_t initDynamicAddr;                   /*!< Initial dynamic address for the device. */
    i3c_device_ibi_info_t *ibiInfo;            /*!< Pointer to IBI request information structure of the device. */
} i3c_device_t;

/* Forward declaration of the i2c_device_control_info_t typedef. */
typedef struct _i2c_device_control_info i2c_device_control_info_t;

/*! @brief I2C device definition. */
typedef struct _i2c_device
{
    list_element_t listNode;                   /*!< list node to link i2c devices in i3c bus. */
    i3c_bus_t *bus;                            /*!< I3C bus pointer, points to current bus the device is attached. */
    i2c_device_control_info_t *devControlInfo; /*!< Pointer to device information structure of the device. */
    uint8_t staticAddr;                        /*!< static address for I2C device. */
    uint8_t lvr;                               /*!< LVR for I2C device. */
} i2c_device_t;

/*! @brief CCC command structure for CCC frame */
typedef struct _i3c_ccc_cmd
{
    uint8_t cmdId;     /*!< Command ID. */
    bool isRead;       /*!< Read command or write command. */
    uint8_t destAddr;  /*!< Destination address for the command, broadcast uses 0x7E, direct access uses dest device
                          dynamic address. */
    void *data;        /*!< Pointer to data to be transmitted or received. */
    uint16_t dataSize; /*!< Data size of data to be transmitted or received. */
} i3c_ccc_cmd_t;

/*! @brief I3C bus transfer structure for general data transfer. */
typedef struct _i3c_bus_transfer
{
    uint32_t regAddr;     /*!< Operate register address of the target device.*/
    uint32_t regAddrSize; /*!< Size of Register address. */
    bool isRead;          /*!< Read transfer or write transfer. */
    void *data;           /*!< Pointer to data to be transmitted or received. */
    uint32_t dataSize;    /*!< Data size of data to be transmitted or received. */
} i3c_bus_transfer_t;

/*! @brief I3C device hardware operation API set. */
typedef struct i3c_device_hw_ops
{
    status_t (*Init)(i3c_device_t *dev);          /*!< Init function to initialize I3C device.*/
    void (*Deinit)(i3c_device_t *dev);            /*!< Deinit function to de-initialize I3C device.*/
    status_t (*ProceedDAA)(i3c_device_t *master); /*!< ProceedDAA function, only required for I3C master device.*/
    bool (*CheckSupportCCC)(i3c_device_t *master, i3c_ccc_cmd_t *cmd); /*!< CheckSupportCCC function, optional for I3C
                                                                          master device, not require for slave device.*/
    status_t (*TransmitCCC)(i3c_device_t *master,
                            i3c_ccc_cmd_t *cmd);      /*!< TransmitCCC function, only require for I3C master device.*/
    status_t (*DoI3CTransfer)(
        i3c_device_t *dev, i3c_bus_transfer_t *xfer); /*!< DoI3CTransfer function, only require for I3C master device.*/
    status_t (*DoI2CTransfer)(
        i2c_device_t *dev, i3c_bus_transfer_t *xfer); /*!< DoI2CTransfer function, only require for I3C slave device.*/
    void (*HotJoin)(i3c_device_t *master);            /*!< HotJoin function.*/
    void (*RequestMastership)(
        i3c_device_t *master); /*!< RequestMastership function, only require for I3C master device.*/
    void (*RegisterIBI)(i3c_device_t *master, uint8_t ibiAddress); /*!< Register IBI address with mandatory byte.*/
    void (*RequestIBI)(i3c_device_t *device, void *data, size_t dataSize); /*!< RequestIBI function.*/
} i3c_device_hw_ops_t;

/*! @brief I3C device information. */
struct _i3c_device_control_info
{
    i3c_device_hw_ops_t *funcs; /*!< Pointer to I3C device hardware operation API sets.*/
    void *resource;             /*!< Pointer to keep I3C device specific resource.*/
    bool isSecondary;           /*!< Specify if the device is secondary device.*/
    bool isHotJoin;             /*!< Enable hot-join if it's secondary master.*/
    void *privateData;          /*!< Pointer to keep I3C device private data.*/
};

